extends Node

var for_start
var speed = 1

var country = {"Adamanty": Color( 1, 0.89, 0.77, 1 ), #Равнинная республика
"Tsarstvo Bascany":        Color( 0.65, 0.16, 0.16, 1 ), # Королевство Истленд
"Bascany Protectorat":     Color( 1, 0.5, 0.31, 1 ) , #Протекторат Истленд 
"Nasadry":                 Color( 1, 0.08, 0.58, 1 ), #Береговое королевство 
"Gorny":                   Color( 0, 1, 1, 1 )  #Саузения 
}


const weapon_and_attak = {
	"Винтовка Токарева": [2, 1],
}
const weapon_podd = {
	"Саперская лопата": [1, 0]
}

const parties_for_randi = {
	1: ["Социал-демократическая партия рабочих", "Социал-демократия"],
	2: ["Партия прогресса", "Социал-демократия"],
	3: ["Национал-социалистическая свободная коммуна", "Анархизм"],
	4: ["Освободительная национальная партия", "Анархизм"],
	5: ["Национальная партия военных", "Фашизм"],
	6: ["Национальные революционеры", "Фашизм"],
	7: ["Центристская трудовая партия", "Центризм"],
	8: ["Партия центра", "Центризм"],
	9: ["Национал-коммунистиченская партия", "Коммунизм"],
	10: ["Левая рука", "Коммунизм"],
	11: ["Партия Народной Свободы и Действия", "Коммунизм"],
	12: ["Социал-республиканская партия", "Социализм"],
	13: ["Крестьяне и рабочие", "Социализм"],
	14: ["Социал-демократическая партия Народного согласия","Социал-демократия"],
}

var contries = ["Adamanty", "Tsarstvo Bascany", "Bascany Protectorat", "Nasadry", "Gorny"]

var wars = {
"Adamanty": [],
"Tsarstvo Bascany": [],
"Bascany Protectorat": [],
"Nasadry": [],
"Gorny": ["Bascany Protectorat", "Adamanty"],
}

const main_parties_in_start = {
"Adamanty":                ["Объедененная либеральная партия", ""], 
"Tsarstvo Bascany":        ['Боковская монархическая партия', ""], 
"Bascany Protectorat":    ['Республиканская фашистская партия', ""],
"Nasadry":                 ['Национальная фашистская партия', ""], 
"Gorny":                   ["Социал-традиционная партия", ""]  
}
