extends Node

var for_start
var speed = 1

var country = {"Adamanty": Color( 1, 0.89, 0.77, 1 ), #Равнинная республика
"Tsarstvo Bascany":        Color( 0.65, 0.16, 0.16, 1 ), # Королевство Истленд
"Bascany Protectorat":     Color( 1, 0.5, 0.31, 1 ) , #Протекторат Истленд 
"Nasadry":                 Color( 1, 0.08, 0.58, 1 ), #Береговое королевство 
"Gorny":                   Color( 0, 1, 1, 1 )  #Саузения 
}


var weapon_and_attak = {
	"Nivel's gun": [2, 1],
}
var weapon_podd = {
	"trench knife": [1, 0]
}

var parties_for_randi = {
	1: ["Социал-демократическая партия рабочих", "Социал-демократия"],
	2: ["Партия прогресса", "Социал-демократия"],
	3: ["Национал-социалистическая свободная коммуна", "Анархизм"],
	4: ["Освободительная национальная партия", "Анархизм"],
	5: ["Национальная партия военных", "Фашизм"],
	6: ["Национальные раволюционеры", "Фашизм"],
	7: ["Центристская трудовая партия", "Центризм"],
	8: ["Партия центра", "Центризм"],
	9: ["Национал-коммунистиченская партия", "Коммунизм"],
	10: ["Левая рука", "Коммунизм"],
	11: ["Социал-республиканская партия", "Социализм"],
	12: ["Крестьяне и рабочие", "Социализм"]
}

var contries = ["Adamanty", "Tsarstvo Bascany", "Bascany Protectorat", "Nasadry", "Gorny"]

var wars = {
"Adamanty": [],
"Tsarstvo Bascany": [],
"Bascany Protectorat": [],
"Nasadry": [],
"Gorny": ["Bascany Protectorat"],
}
