extends Node

const polAvtWeaponLevel: Dictionary = { 
'Винтовка Токарева': [1,1,1,1,1],
'Эксперементальная Винтовка': [1,1,1,1,1],
'Исследования Токарева': [],
'Винтовка Федорова': [1,1,1,1,1]}

const weaponAvtLevel: Dictionary = {
'Исследования Лебеля': [],
'Ручной пулемет Якубовича': [1,1,1,1,1],
'ПП Манхлера': [1,1,1,1,1],
'Автомат Ли-Энфильд': [1,1,1,1,1]}

const techCarsLevel: Dictionary = {
"Первый Броневик Путилова": [1,1,1,1,1],
"Броневик Путилова": [1,1,1,1,1],
"Морской Броневик Путилова": [1,1,1,1,1],
"Броневик Лупковского": [1,1,1,1,1],
"Морской Броневик Лупковского": [1,1,1,1,1]}

const techTanksLevel: Dictionary = {
"Легкий танк Вездеход": [1,1,1,1,1],
"Средний танк 'Галиция'": [1,1,1,1,1],
"Тяжелый танк Шевченко": [1,1,1,1,1],
"Газовый Тяжелый танк Шевченко": [1,1,1,1,1]}

const fireSupportLevel: Dictionary = {
"Окопный гранотомет": [1,1,1,1,1],
"Противотанковое ружье": [1,1,1,1,1],
"Огнемет 'Клейвф'": [1,1,1,1,1],
"Переносимый Баскийский пулемет": [1,1,1,1,1],
"Миномет Эдварда Мосли": [1,1,1,1,1],
"Газовое ружье": [1,1,1,1,1]}

const artilleryLevel: Dictionary = {
"Артеллерия 1914 года": [1,1,1,1,1],
"Артеллерия 1916 года": [1,1,1,1,1],
"Артеллерия 1918 года": [1,1,1,1,1],
'Артеллерия Французского образца': [1,1,1,1,1]}

const cavalrylevel: Dictionary = {
'Карабин': [1, 0], #attak, hp
'Бронирование всадника':  [0, 1],}

const grenadesLevel: Dictionary = {
"Граната": [1,1,1,1,1],
"Противотанковая граната": [1,1,1,1,1],
"Гранатный арбалет": [1,1,1,1,1],
}
