extends Node


var factory_production_inventions: Dictionary = {
	"Плавильные печи": ["Электропечи", "Мартеновская печь"],
	"Полимеры":        ["Ограниченное стекло"],
	
}


const military_inventions: Dictionary = {
	"Стратегические бомбардировщики": 0,
	"/Полугусеничные бронемашины": 0,
	"/Ранние танкетки":             0,
	"/Тактические бомбардировщики":    0,
	"/Штурмовые бронемашины": 0,
	"/Штурмовые танки":       0,
	"/Танкетки":             0,
	
	"/Ранняя самоходная артиллерия": 1,
	"/Cамоходная артиллерия": 1,
	
	"/Групповая тактика": 0,
	"/Полевые комиссары": 0,
	"/Газовые атаки":      0,
	"/Массированный штурм":0,
	"/Массированная бомбардировка": 0,
	"/Переливание крови":           0,
	"/Создание штурмовых отрядов": 0,
	"/Точечная бомбардировка":     0,
	"/Подготовка тыловиков": 1,
	"/Моторизация пехоты":   1,
	
	"/Автопистолеты": 1,
	"/Бомбометы":   0,
	"/Каски для пехоты": 0,
	"/Ленточные пулеметы": 0,
	"/Автоматические винтовки": 1,
	
	
}
