extends Node

var PlayerObject: Node2D
var start_country_for_player = null

var playersObj: Dictionary = {
"Республика Адамантия": [Color(0.533333, 1, 0.596078)],
"Легион Насардия": [Color(0.501961, 0.486275, 1)],
'Социалистическая Народная Республика Баскакия':[Color(0.230469, 0.69339, 1)],
'Народная Республика Горния': [Color(0.785767, 0.472656, 1)],
'Империя Баскакия': [Color(1, 0.519531, 0.913666)],
}

var political_ideology_of_countries: Dictionary = {
"Республика Адамантия": "Либералы",
"Легион Насардия":  'Милитаристы',
'Социалистическая Народная Республика Баскакия': 'Коммунисты',
'Народная Республика Горния': "Социалисты",
'Империя Баскакия': "Монархисты",
}

