extends Node

const list_of_players_on_start: Dictionary = {
	"Хорезм": {
		"Идеология": "Либералы",
		"Цвет": Color(1, 0, 0)}, 
	"Горния": {
		"Идеология": "Либералы",
		"Цвет": Color(0, 0.566406, 0.207977)},
	"Баскония": {
		"Идеология": "Либералы",
		"Цвет": Color(0.323029, 0.566406, 0)},
	"СЗ": {
		"Идеология": "Либералы",
		"Цвет": Color(0.745694, 0.757813, 0.370026)},
	"Кракожия": {
		"Идеология": "Либералы",
		"Цвет": Color(0, 0.415686, 1)},
	"Баскакская Торговая Компания": {
		"Идеология": "Либералы",
		"Цвет": Color(0.710938, 0.44989, 0)},
	"Баскакия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.664063, 0.217896, 0)},
	"Поляния": {
		"Идеология": "Либералы",
		"Цвет": Color(0.742188, 0.086975, 0.086975)},
	"Амани": {
		"Идеология": "Либералы",
		"Цвет": Color(0, 0.472656, 0.461578)},
	"Адамантия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.342934, 0.172577, 0.679688)},
	"Кавардация": {
		"Идеология": "Либералы",
		"Цвет": Color(0.691406, 0.245773, 0.444219)},
	"Насардия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.257126, 0.535156, 0.483026)},
	"Тернокат": {
		"Идеология": "Либералы",
		"Цвет": Color(0.78125, 0.439453, 0)},
	"Иллирия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.381058, 0.479009, 0.863281)},
	"Теверция": {
		"Идеология": "Либералы",
		"Цвет": Color(0.40543, 0.65625, 0.397339)},
	"Кривечия": {
		"Идеология": "Либералы",
		"Цвет": Color(1, 0.402344, 0.402344)},
	"Зличания": {
		"Идеология": "Либералы",
		"Цвет": Color(0.735621, 0.340866, 0.980469)},
}


const economy: Dictionary = {
	"Экономическая_модель": "Свободная_экономика",
	"Торговая_политика":    "Меркантилизм",
	
	"Цена_на_фабрики":      0,
	"Субсидирование":       false,
	"Доходы_фабрикантов":   80,
	
	"Пошлины":              0,
	"Максимальные_пошлины": 15,
	"Экспорт_товаров":      90,
	
	"Максимум_железных_дорог": 3,
	"Максимум_инфраструктуры": 3,
	
	"Производительность_фабрик": 0,
	"Производительность_ферм":   0,
	"Производительность_шахт":   0,
	
	"Налоги_на_бедных":     0,
	"Налоги_на_богатых":    0,
	"ВВП":                  0,
	"Кроны":                15000,
	"Очки_исследования":    0,
	
	"Снабжение_армии":      10,
	"Минимальная_зарплата": 0,
	"Пенсии":               0,
	"Максимальный_рабочий_день": 0,
	"Пособия_по_безработице":    0,
	"Здравохранение":            0,
	"Образование":               0,
	"Помощь_инвалидам":          0,
	
	"Прирост_населения":    1,
	"Привлечение_иммигрантов":    1,
}


const buildings_on_start: Dictionary = {
	"Морской_завод": {
		"Сталь":           2,
		"Электрозапчасти": 1,
		"Автозапчасти":    1,
		"Пиломатериалы":   1,
	},
	"Военный_завод": {
		"Сталь":           2,
		"Электрозапчасти": 1,
		"Автозапчасти":    1,
		"Пиломатериалы":   1,
	},
	"Сталелитейный_завод": {
		"Пиломатериалы":   2,
		"Электрозапчасти": 1,
		"Автозапчасти":    2,
		"Стекло":          1,
		"Железо":          1,
		"Электропечи":     1,
	},
	"Текстильная_фабрика": {
		"Пиломатериалы":   2,
		"Стекло":          1,
		"Железо":          1,
	},
	"Стеклозавод": {
		"Сталь":           1,
		"Железо":          1,
		"Пиломатериалы":   1,
	},
	"Завод_электрозапчастей": {
		"Сталь":           2,
		"Пиломатериалы":   1,
		"Стекло":          1,
	},
	"Завод_автозапчастей": {
		"Сталь":           2,
		"Стекло":          1,
		"Электрозапчасти": 1,
	},
	"Завод_удобрений": {
		"Пиломатериалы":   2,
		"Сталь":           1,
		"Железо":          1,
		"Стекло":          1,
	},
	"Завод_пиломатериалов": {
		"Стекло":          1,
		"Сталь":           1,
		"Древесина":       1,
	},
	"Завод_динамита": {
		"Пиломатериалы":   2,
		"Сталь":           1,
		"Железо":          1,
		"Стекло":          1,
	},
	"Автозавод": {
		"Сталь":           3,
		"Стекло":          2,
		"Электрозапчасти": 2,
		"Резина":          1,
		"Автозапчасти":    2,
	},
	"Авиазавод": {
		"Сталь":           3,
		"Стекло":          2,
	},
	"Тракторный_завод": {
		"Сталь":           2,
		"Стекло":          1,
		"Электрозапчасти": 2,
		"Резина":          1,
		"Автозапчасти":    2,
	},
	"Телеграфный_завод": {
		"Сталь":           1,
		"Стекло":          1,
		"Автозапчасти":    1,
	},
	"Телефонный_завод": {
		"Сталь":           2,
		"Стекло":          1,
		"Автозапчасти":    1,
	},
	"Радиозавод": {
		"Сталь":           2,
		"Автозапчасти":    2,
	},

	"Мебельная_фабрика": {
		"Стекло":          1,
		"Сталь":           1,
		"Древесина":       2,
	},
	"Спиртзавод": {
		"Стекло":          1,
		"Сталь":           2,
		"Древесина":       2,
	},
	"Фабрика_одежды": {
		"Стекло":          1,
		"Сталь":           1,
		"Древесина":       3,
	},
	"Фабрика_обогревателей": {
		"Сталь":           1,
		"Стекло":          1,
		"Электрозапчасти": 1,
		"Автозапчасти":    1,
	},
	"Пекарня": {
		"Миксеры":         1,
		"Электропечи":     1,
		"Автозапчасти":    1,
		"Сталь":           1,
		"Стекло":          1,
	},
	"Консервзавод": {
		"Автозапчасти":    1,
		"Сталь":           1,
		"Стекло":          1,
	},
	"Топливный_завод": {
		"Сталь":           2,
		"Автозапчасти":    1,
	},

}

const goods_to_factory: Dictionary = {
	"Лекарства":       "Фабрика медикаментов",
	"Сталь":           "Сталелитейный_завод",
	"Ткань":           "Текстильная_фабрика",
	"Стекло":          "Стеклозавод",
	"Электрозапчасти": "Завод_электрозапчастей",
	"Автозапчасти":    "Завод_автозапчастей",
	"Удобрения":       "Завод_удобрений",
	"Пиломатериалы":   "Завод_пиломатериалов",
	"Динамит":         "Завод_динамита",
	"Автомобили":      "Автозавод",
	"Тракторы":        "Тракторный_завод",
	"Телеграфы":       "Телеграфный_завод",
	"Телефоны":        "Телефонный_завод",
	"Радио":           "Радиозавод",
	"Мебель":          "Мебельная_фабрика",
	"Спиртное":        "Спиртзавод",
	"Одежда":          "Фабрика_одежды",
	"Обогреватели":    "Фабрика_обогревателей",
	"Хлеб":            "Пекарня",
	"Консервы":        "Консервзавод",
	"Топливо":         "Топливный_завод",
	"Аэроплан":        "Авиазавод",

}


const sprites_of_goods: Dictionary = {
	"Уголь":     "res://Graphics/Sprites/Goods/Coal.png",
	"Железо":    "res://Graphics/Sprites/Goods/Iron.png",
	"Нефть":     "res://Graphics/Sprites/Goods/Oil.png",
	"Резина":    "res://Graphics/Sprites/Goods/Rubber.png",
	"Хлопок":    "res://Graphics/Sprites/Goods/Cotton.png",
	"Зерно":     "res://Graphics/Sprites/Goods/Seed.png",
	"Скот":      "res://Graphics/Sprites/Goods/Cattle.png",
	"Селитра":   "res://Graphics/Sprites/Goods/Nitrate.png",
	"Древесина": "res://Graphics/Sprites/Goods/Wood.png",
	"Лекарственные_растения": "res://Graphics/Sprites/Goods/Wood.png",
	
	"Сталь":           "res://Graphics/Sprites/Goods/Steel.png",
	"Стекло":          "res://Graphics/Sprites/Goods/Glass.png",
	"Ткань":           "res://Graphics/Sprites/Goods/Fabric.png",
	"Электрозапчасти": "res://Graphics/Sprites/Goods/Electric parts.png",
	"Автозапчасти":    "res://Graphics/Sprites/Goods/Electric parts.png",
	"Удобрения":       "res://Graphics/Sprites/Goods/Fertilizer.png",
	"Пиломатериалы":   "res://Graphics/Sprites/Goods/Nitrate.png",
	"Динамит":         "res://Graphics/Sprites/Goods/Nitrate.png",
	
	"Автомобили":      "res://Graphics/Sprites/Goods/Car.png",
	"Тракторы":        "res://Graphics/Sprites/Goods/Car.png",
	"Телеграфы":       "res://Graphics/Sprites/Goods/Telegraph.png",
	"Телефоны":        "res://Graphics/Sprites/Goods/Phone.png",
	"Радио":           "res://Graphics/Sprites/Goods/Radio.png",
	
	"Мебель":          "res://Graphics/Sprites/Goods/Furniture.png",
	"Спиртное":        "res://Graphics/Sprites/Goods/Alhohol.png",
	"Одежда":          "res://Graphics/Sprites/Goods/Clothes.png",
	"Обогреватели":    "res://Graphics/Sprites/Goods/Heater.png",
	"Хлеб":            "res://Graphics/Sprites/Goods/Bread.png",
	"Консервы":        "res://Graphics/Sprites/Goods/Canned food.png",
	"Топливо":         "res://Graphics/Sprites/Goods/Gas.png",
	"Табак":           "res://Graphics/Sprites/Goods/Tabaco.png",
	"Лекарства":       "res://Graphics/Sprites/Goods/Nitrate.png",
	"Чай":             "res://Graphics/Sprites/Goods/Tea.png",
	"Кофе":            "res://Graphics/Sprites/Goods/Coffee.png", 
	
	"Снаряды":             "res://Graphics/Sprites/Goods/Shells.png",
	"Боеприпасы":          "res://Graphics/Sprites/Goods/Ammunition.png",
	"Пулеметы":            "res://Graphics/Sprites/Goods/Machine gun.png",
	"Артиллерия":          "res://Graphics/Sprites/Goods/Artillery.png",
	"Аэроплан":            "res://Graphics/Sprites/Goods/Airplane.png",
	"Магазинные_винтовки": "res://Graphics/Sprites/Goods/Bolt-action rifle.png",
	"Бронемашины":         "res://Graphics/Sprites/Goods/Airplane.png",
	"Танки":               "res://Graphics/Sprites/Goods/Airplane.png",
}


const output: Dictionary = {
	"Уголь":     0,
	"Железо":    0,
	"Нефть":     0,
	"Резина":    0,
	"Хлопок":    0,
	"Зерно":     0,
	"Скот":      0,
	"Селитра":   0,
	"Древесина": 0,
	"Лекарственные_растения": 0,
	
	"Сталь":           0,
	"Стекло":          0,
	"Ткань":           0,
	"Электрозапчасти": 0,
	"Автозапчасти":    0,
	"Удобрения":       0,
	"Пиломатериалы":   0,
	"Динамит":         0,
	
	"Автомобили":      0,
	"Тракторы":        0,
	"Телеграфы":       0,
	"Телефоны":        0,
	"Радио":           0,
	
	"Мебель":          0,
	"Спиртное":        0,
	"Одежда":          0,
	"Обогреватели":    0,
	"Хлеб":            0,
	"Консервы":        0,
	"Топливо":         0,
	"Табак":           0,
	"Лекарства":       0,
	"Чай":             0,
	"Кофе":            0, 
	
	"Снаряды":             0,
	"Боеприпасы":          0,
	"Пулеметы":            0,
	"Артиллерия":          0,
	"Аэроплан":            0,
	"Магазинные_винтовки": 0,
	"Бронемашины":         0,
	"Танки":               0,
}


const list_of_units: Dictionary = {
	"Аэроплан-разведчик":   0,
	"Боевой аэроплан":      0,
	"Аэроплан-истребитель": 0,
	"Бомбардировщик":       0,
	
	"Пехота":           0, 
	"Гренадеры":        0, #Штурмовая пехота
	"Артиллерия":       0,
	
	"Кавалерия":        0,
	"Бронемашины":      0,
	"Танки":            0,
	
	"Подводная лодка":     0,
	"Рейдер":              0,
	
	"Дредноут":            0,
	"Броненосец":          0,
	"Крейсер смерти":      0,
	"Броненосец смерти":   0,
}


const fleet_units: Array = [
	"Подводная лодка",
	"Рейдер",
	"Дредноут",
	"Броненосец",
	"Крейсер смерти",
	"Броненосец смерти",
]


const units_for_training: Array = [
	"Аэроплан-разведчик",
	"Пехота",
	"Артиллерия",
	"Кавалерия",
	"Подводная лодка",
	"Рейдер",
]


const levels_of_technologies: Dictionary = {
	"Фабричное производство":    0,
	"Фермерское производство":   0,
	"Добыча":                    0,
	"Инфраструктура и снабжение":0,
	
	"Управление армией":         0,
	"Техника":                   0,
	"Тяжелое вооружение":        0,
	"Легкое вооружение":         0,
	"Флот":                      0,
}


var not_factories: Array = ["Военный_завод", "Морской_завод"]

var country_to_start: String = ""
var player:           Object


var list_of_players:  Array = []

