extends Node

const list_of_players_on_start: Dictionary = {
	"Хорезм": {
		"Идеология": "Либералы",
		"Цвет": Color(1, 0, 0)}, 
	"Горния": {
		"Идеология": "Либералы",
		"Цвет": Color(0, 0.566406, 0.207977)},
	"Баскония": {
		"Идеология": "Либералы",
		"Цвет": Color(0.323029, 0.566406, 0)},
	"СЗ": {
		"Идеология": "Либералы",
		"Цвет": Color(0.745694, 0.757813, 0.370026)},
	"Кракожия": {
		"Идеология": "Либералы",
		"Цвет": Color(0, 0.415686, 1)},
	"Баскакская Торговая Компания": {
		"Идеология": "Либералы",
		"Цвет": Color(0.710938, 0.44989, 0)},
	"Баскакия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.664063, 0.217896, 0)},
	"Поляния": {
		"Идеология": "Либералы",
		"Цвет": Color(0.742188, 0.086975, 0.086975)},
	"Амани": {
		"Идеология": "Либералы",
		"Цвет": Color(0, 0.472656, 0.461578)},
	"Адамантия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.342934, 0.172577, 0.679688)},
	"Кавардация": {
		"Идеология": "Либералы",
		"Цвет": Color(0.691406, 0.245773, 0.444219)},
	"Насардия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.257126, 0.535156, 0.483026)},
	"Тернокат": {
		"Идеология": "Либералы",
		"Цвет": Color(0.78125, 0.439453, 0)},
	"Иллирия": {
		"Идеология": "Либералы",
		"Цвет": Color(0.381058, 0.479009, 0.863281)},
	"Теверция": {
		"Идеология": "Либералы",
		"Цвет": Color(0.40543, 0.65625, 0.397339)},
	"Кривечия": {
		"Идеология": "Либералы",
		"Цвет": Color(1, 0.402344, 0.402344)},
	"Зличания": {
		"Идеология": "Либералы",
		"Цвет": Color(0.735621, 0.340866, 0.980469)},
}


const economy: Dictionary = {
	"Экономическая_модель": "Свободная_экономика",
	"Торговая_политика":    "Меркантилизм",
	
	"Цена_на_фабрики":      0,
	"Субсидирование":       false,
	"Доходы_фабрикантов":   80,
	
	"Пошлины":              0,
	"Максимальные_пошлины": 15,
	"Экспорт_товаров":      90,
	
	"Налоги_на_бедных":     0,
	"Налоги_на_богатых":    0,
	"ВВП":                  0,
	"Кроны":                0,
}


const buildings_on_start: Dictionary = {
	"Военный_завод": {
		"Сталь":           2,
		"Электрозапчасти": 1,
		"Автозапчасти":    1,
		"Пиломатериалы":   1,
	},
	"Казармы": {
		"Пиломатериалы":   2,
		"Железо":          1,
	},
	"Сталелитейный_завод": {
		"Пиломатериалы":   2,
		"Электрозапчасти": 1,
		"Автозапчасти":    2,
		"Стекло":          1,
		"Железо":          1,
		"Электропечи":     1,
	},
	"Текстильная_фабрика": {
		"Пиломатериалы":   2,
		"Стекло":          1,
		"Железо":          1,
	},
	"Стеклозавод": {
		"Сталь":           1,
		"Железо":          1,
		"Пиломатериалы":   1,
	},
	"Завод_электрозапчастей": {
		"Сталь":           2,
		"Пиломатериалы":   1,
		"Стекло":          1,
	},
	"Завод_автозапчастей": {
		"Сталь":           2,
		"Стекло":          1,
		"Электрозапчасти": 1,
	},
	"Завод_удобрений": {
		"Пиломатериалы":   2,
		"Сталь":           1,
		"Железо":          1,
		"Стекло":          1,
	},
	"Завод_пиломатериалов": {
		"Стекло":          1,
		"Сталь":           1,
		"Древесина":       1,
	},
	"Завод_динамита": {
		"Пиломатериалы":   2,
		"Сталь":           1,
		"Железо":          1,
		"Стекло":          1,
	},
	"Автозавод": {
		"Сталь":           3,
		"Стекло":          2,
		"Электрозапчасти": 2,
		"Резина":          1,
		"Автозапчасти":    2,
	},
	"Авиазавод": {
		"Сталь":           3,
		"Стекло":          2,
	},
	"Тракторный_завод": {
		"Сталь":           2,
		"Стекло":          1,
		"Электрозапчасти": 2,
		"Резина":          1,
		"Автозапчасти":    2,
	},
	"Телеграфный_завод": {
		"Сталь":           1,
		"Стекло":          1,
		"Автозапчасти":    1,
	},
	"Телефонный_завод": {
		"Сталь":           2,
		"Стекло":          1,
		"Автозапчасти":    1,
	},
	"Радиозавод": {
		"Сталь":           2,
		"Автозапчасти":    2,
	},

	"Мебельная_фабрика": {
		"Стекло":          1,
		"Сталь":           1,
		"Древесина":       2,
	},
	"Спиртзавод": {
		"Стекло":          1,
		"Сталь":           2,
		"Древесина":       2,
	},
	"Фабрика_одежды": {
		"Стекло":          1,
		"Сталь":           1,
		"Древесина":       3,
	},
	"Фабрика_обогревателей": {
		"Сталь":           1,
		"Стекло":          1,
		"Электрозапчасти": 1,
		"Автозапчасти":    1,
	},
	"Хлебозавод": {
		"Миксеры":         1,
		"Электропечи":     1,
		"Автозапчасти":    1,
		"Сталь":           1,
		"Стекло":          1,
	},
	"Консервзавод": {
		"Автозапчасти":    1,
		"Сталь":           1,
		"Стекло":          1,
	},
	"Топливный_завод": {
		"Сталь":           2,
		"Автозапчасти":    1,
	},

}

const goods_to_factory: Dictionary = {
"Сталь":           "Сталелитейный_завод",
"Ткань":           "Текстильная_фабрика",
"Стекло":          "Стеклозавод",
"Электрозапчасти": "Завод_электрозапчастей",
"Автозапчасти":    "Завод_автозапчастей",
"Удобрения":       "Завод_удобрений",
"Пиломатериалы":   "Завод_пиломатериалов",
"Динамит":         "Завод_динамита",
"Автомобили":      "Автозавод",
"Тракторы":        "Тракторный_завод",
"Телеграфы":       "Телеграфный_завод",
"Телефоны":        "Телефонный_завод",
"Радио":           "Радиозавод",
"Мебель":          "Мебельная_фабрика",
"Спиртное":        "Спиртзавод",
"Одежда":          "Фабрика_одежды",
"Обогреватели":    "Фабрика_обогревателей",
"Хлеб":            "Хлебозавод",
"Консервы":        "Консервзавод",
"Топливо":         "Топливный_завод",
"Аэроплан":        "Авиазавод",

}

const bonuses_in_production: Dictionary = {
	"Уголь":           0,
	"Железо":          0,
	"Нефть":           0,
	"Резина":          0,
	"Селитра":         0,
	"Зерно":           0,
	"Скот":            0,
	"Лекарственные_растения": 0,
	
	"Сталь":           0,
	"Электрозапчасти": 0,
	"Автозапчасти":    0,
	"Автомобили":      0,
	"Тракторы":        0,
	"Телефоны":        0,
	"Радио":           0,
	
	"Хлеб":            0,
	"Консервы":        0,
	"Топливо":         0,
	"Лекарства":       0,
	
	
}

const output: Dictionary = {
	"Уголь":     0,
	"Железо":    0,
	"Нефть":     0,
	"Резина":    0,
	"Хлопок":    0,
	"Зерно":     0,
	"Скот":      0,
	"Селитра":   0,
	"Древесина": 0,
	"Лекарственные_растения": 0,
	
	"Сталь":           0,
	"Стекло":          0,
	"Ткань":           0,
	"Электрозапчасти": 0,
	"Автозапчасти":    0,
	"Удобрения":       0,
	"Пиломатериалы":   0,
	"Динамит":         0,
	
	"Автомобили":      0,
	"Тракторы":        0,
	"Телеграфы":       0,
	"Телефоны":        0,
	"Радио":           0,
	
	"Мебель":          0,
	"Спиртное":        0,
	"Одежда":          0,
	"Обогреватели":    0,
	"Хлеб":            0,
	"Консервы":        0,
	"Топливо":         0,
	"Табак":           0,
	"Лекарства":       0,
	
	"Снаряды":             0,
	"Боеприпасы":          0,
	"Пулеметы":            0,
	"Артиллерия":          0,
	"Аэроплан":           0,
	"Магазинные_винтовки": 0,
}

var not_factories: Array = ["Военный_завод", "Казармы"]

var country_to_start: String = ""
var player:           Object


var list_of_players:  Array = []

