extends Node


const graph: Dictionary = {
	"Черновцы": ["Лодзь", "Станислав", "Галич", "Калуш"],
}


var provinces_of_countries: Dictionary = {
	"Хорезм":   
		["Лодзь", "Станислав", "Черновцы", "Галич", "Калуш", "Познань", "Ровно",],
	"Горния":  
		 ["Черновицы", "Тарнополь", "Кременец", "Броды"],
	"Баскония":
		 ["Рутивль", "Перемышль", "Батые"],
	"СЗ":      
		 ["Луцк"],
	"Кракожия": 
		["Коломна", "Витебск"],
	"Баскакская Торговая Компания":
		 ["Подолье", "Любич", "Теребовль", "Пинск", "Гродно"],
	"Баскакия":   
		["Вручий", "Тулов", "Желув", "Горловка", "Сумы", "Житомир", "Черкасс", "Покровск", "Изюм", "Макеевка"],
	"Поляния":   
		 ["Херсон", "Полтава"],
	"Амани":     
		 ["Симферополь", "Винница"],
	"Адамантия": 
		 ["Должанск", "Бердичев", "Константиновка", "Новомосковск",  "Коростень", "Измаил"],
	"Насардия":  
		 ["Донецк", "Ченстохова", "Катовице", "Николаев", "Берегово", "Буковина", "Пшемысль"],
	"Кавардация":
		 ["Дубно", "Хмельницкий", "Севастополь", "Закопане", "Ивано-Франковск"],
	"Тернокат":  
		 ["Ужгород", "Каменец-Подольск",],
	"Иллирия":   
		 ["Львов", "Борка", "Звижень", "Гримайлов", "Болехов"], #Западный Азис
	"Кривечия":
		["Волынский", "Ковель", "Щепеткова", "Проскуров", "Коломыя", "Стрый"],
	"Теверция":  
		 ["Белая Церковь", "Павлоград", "Мелитополь", "Лисичанск", "Пмлица"], #Третья Поляния
	"Зличания":  
		 ["Мукачево", "Нетешин", "Дрогобыч", "Старокостантинов",],  #Вольная Поляния
}

	#"Черногорск",


const resourses_of_provinces: Dictionary = {
	"Изюм": ["Железо", "Сталь",],
	
	"Покровск": ["Железо", "Уголь", "Сталь",],
	
	"Черкасс": [
		"Уголь",
		"Сталь", 
		"Стекло",
		],
	
	"Житомир": [
		"Скот",
		"Древесина",
		"Пиломатериалы",
		"Мебель"
		],
	
	"Горловка": [
		"Скот",
		"Зерно",
		"Древесина",
		"Пиломатериалы",
		"Мебель",
		"Хлеб",
		],
	
	"Сумы": [
		"Древесина",
		"Скот",
		"Зерно",
		"Спиртное",
		],
	
	"Желув": [
		"Древесина",
		"Скот",
		"Зерно",
		"Спиртное",
		"Хлеб",
		],
	
	"Тулов": [
		"Скот",
		"Зерно",
		"Древесина",
		"Пиломатериалы",
		"Мебель",
		"Хлеб"
		],
	
	"Вручий": [
		"Уголь",
		"Стекло",
		],

	"Желов": [
		"Уголь",
		"Древесина",
		"Пиломатериалы",
		"Мебель"
		],
	
	"Макеевка": [
		"Скот",
		"Древесина",
		"Пиломатериалы",
		"Мебель"
		],
	
	"Любич": [
		"Уголь",
		 "Нефть",
		 "Топливо",
		],

	"Подолье": [
		"Уголь",
		"Стекло",
		],
	
	"Теребовль": [
		"Нефть",
		],
	
	"Пинск": [
		"Скот",
		"Древесина",
		],
	
	"Гродно": [
		"Зерно",
		"Скот",
		"Древесина",
		"+Заставна",
		],
	
	"Коломна": [
		"Нефть",
		"Хлопок",
		"Древесина",
		"Топливо",
		"Пиломатериалы",
		"Ткань"
		],
	
	"Витебск": [
		"Хлопок",
		"Скот",
		"Табак",
		"Лекарственные_растения",
		"Лекарства",
		"Ткань",
		
		],
	
	"Броды": [
		"Уголь",
		"Железо",
		"Сталь",
		"+Нырков",
		"+Залещики",
		"+Мигово",
		],
	
	"Кременец": [
		"Скот",
		"Табак",
		"Хлопок",
		"Ткань",
		"Одежда",
		"+Гуменне",
		"+Снина",
		"+Раковчик",
		],
	
	"Тарнополь": [
		"Уголь",
		"Стекло"
		],
	
	"Черновицы": [
		"Лекарственные_растения",
		 "Скот",
		 "Зерно",
		"Лекарства",
		"+Замосць",
		"+Свидник",
		],
	
	"Лодзь": [
		"Уголь",
		"Железо",
		"Нефть",
		"Топливо",
		"+Вижница",
		],
	
	"Станислав": [
		"Хлопок",
		"Скот",
		"Зерно",
		"Табак",
		"Ткань",
		"Одежда",
		"Хлеб",
		"+Нароль",
		],
	
	"Галич": [
		"Хлопок",
		"Табак",
		"Ткань",
		"Одежда",
		],

	"Черновцы": [
		"Уголь",
		"Железо",
		"Сталь",
		"Автозапчасти",
		"+Богородчаны",
		],
	
	"Калуш": [
		"Нефть",
		"Топливо",
		"+Угринов",
		"+Тлумач",
		],
	
	"Познань": [
		"Лекарственные_растения",
		"Хлопок",
		"Лекарства",
		],
	"Ровно": [
		"Резина",
		"Сталь",
		"Автомобили",
		],
	
	"Луцк": [
		"Уголь",
		"Железо",
		"Зерно",
		"Скот",
		"Хлопок",
		"Сталь",
		"Автозапчасти",
		"Ткань",
		"Одежда",
		"Хлеб",
		
		],
	
	"Рутивль": [
		"Нефть",
		"Топливо",
		"+Трускавец",
		],
	
	"Перемышль": [
		"Уголь",
		"Железо",
		"Табак",
		"Сталь",
		"+Пядичи",
		],
	
	"Батые": [
		"Хлопок",
		"Скот",
		"Зерно",
		"Табак",
		"Консервы"
		],
	
	"Коломыя": [
		"Нефть",
		"Зерно",
		"Топливо",
		"Хлеб",
		],
	
	"Стрый": [
		"Хлопок",
		"Скот",
		"Зерно",
		"Хлеб",
		],
	
	"Ковель": [
		"Резина",
		"Зерно",
		"Древесина",
		"Хлеб",
		],

	"Щепеткова": [
		"Резина",
		"Хлопок",
		"Зерно",
		"Древесина",
		"Хлеб",
		"Ткань",
		"Одежда",
		],
	
	"Волынский": [
		"Резина",
		"Табак",
		"Зерно",
		"Древесина",
		"Хлеб",
		],
	
	"Проскуров": [
		"Резина",
		"Лекарственные_растения",
		"Зерно",
		"Древесина",
		"Хлеб",
		],
	
	"Львов": [
		"Резина",
		"Табак",
		"Хлопок",
		"Зерно",
		"Древесина",
		"Хлеб",
		],
	
	"Болехов": [
		"Резина",
		"Скот",
		"Хлопок",
		"Зерно",
		"Древесина",
		"Хлеб",
		],
	
	"Борка": [
		"Резина",
		"Табак",
		"Хлопок",
		"Зерно",
		"Древесина",
		"Хлеб",
		],
	
	"Звижень": [
		"Резина",
		"Табак",
		"Хлопок",
		"Зерно",
		"Древесина",
		"Хлеб",
		],
	"Гримайлов": [
		"Зерно",
		"Скот",
		"Хлеб",
		],
	
	"Ивано-Франковск": [
		"Зерно",
		"Скот",
		"Хлеб",
		],
	
	"Хмельницкий": ["Резина", "Зерно", "Скот", "Хлопок", "Ткань", "Хлеб"],
	
	"Дубно": ["Резина", "Железо", "Уголь", "Селитра", "Зерно", "Хлеб",],
	
	"Ужгород": [
		"Железо",
		"Уголь",
		"Скот",
		"Зерно",
		"Хлеб",
		],
	
	"Каменец-Подольск": ["Железо", "Уголь", "Скот", "Зерно", "Хлеб", "Сталь", "Автозапчасти"],
	
	"Нетешин": [
		"Скот",
		"Зерно",
		"Уголь",
		"Резина",
		"Стекло",
		"Электрозапчасти",
		],
	
	"Дрогобыч": [
		"Зерно",
		"Скот",
		"Хлопок"],
	
	"Старокостантинов": [
		"Резина",
		"Зерно",
		"Скот",
		"Хлопок",
		],
	
	"Мукачево": ["Железо", "Уголь", "Селитра", "Зерно", "3Сталь", "Автозапчасти", "Автомобили"],
	
	"Лисичанск": [
		"Железо",
		"Уголь",
		],
	
	"Павлоград": [
		"Железо",
		"Уголь",
		],
	
	"Мелитополь": [
		"Зерно",
		"Скот",
		"Хлопок"
		],

	"Пмлица": [
		"Хлопок",
		"Лекарственные_растения",
		"Табак",
		],
	
	"Белая Церковь": [
		"Хлопок",
		"Лекарственные_растения",
		"Табак",
		"Лекарства",
		],
	
	"Севастополь": [
		"Резина",
		"Хлопок",
		"Табак",
		"Ткань",
		],
	
	"Закопане": [
		"Резина",
		"Хлопок",
		"Табак",
		"Ткань",
		"Древесина",
		"Одежда",
		],
	
	"Буковина": [
		"Хлопок",
		"Лекарственные_растения",
		"Табак",
		"Древесина",
		"Лекарства",
		],
	
	"Берегово": [
		"Зерно",
		"Скот",
		"Древесина"
		],
	
	"Ченстохова": [
		"Железо",
		"Уголь",
		"Древесина",
		"Сталь"
		],
	
	"Пшемысль": [
		"Зерно",
		"Скот",
		"Древесина",
		"Спиртное",
		],
	
	"Донецк": [
		"Железо",
		"Уголь",
		"Зерно",
		"Скот",
		"Древесина",
		"Спиртное",
		],

	"Катовице": [
		"Железо",
		"Уголь",
		"Древесина",
		"Зерно",
		"Хлеб",
		],
	
	"Николаев": [
		"Зерно",
		"Скот",
		"Древесина",
		"Хлеб",
		],
	
	"Винница": [
		"Железо",
		"Уголь",
		"Древесина",
		"Зерно",
		"Хлеб",
		],
	
	"Симферополь": [
		"Железо",
		"Уголь",
		"Зерно",
		"Скот",
		"Хлеб",
		],
	
	"Херсон": [
		"Железо",
		"Уголь",
		"Древесина",
		"Скот",
		"Пиломатериалы",
		],
	
	"Полтава": [
		"Железо",
		"Уголь",
		"Зерно",
		"Скот",
		"Спиртное",
		"Хлеб"
		],
	
	"Должанск": [
		"Железо",
		"Уголь",
		"Древесина",
		"Сталь",
		],
	
	"Бердичев": [
		"Железо",
		 "Уголь",
		"Древесина",
		"Зерно",
		"Хлеб",
		],
	
	"Новомосковск": [
		"Железо",
		"Уголь",
		"Древесина",
		],
	
	"Коростень": [
		"Железо",
		"Уголь",
		"Зерно",
		"Хлопок",
		"Хлеб",
		],
	
	"Измаил": [
		"Зерно",
		"Скот",
		"Древесина",
		"Спиртное",
		],
	
	"Константиновка": [
		"Железо",
		"Уголь",
		"Древесина",
		"Зерно",
		"Хлеб",
		],
}


const resourses_of_villages: Dictionary = {
	"Снина":[
		"Зерно",
		],
	"Гуменне":[
		"Зерно",
		],
	"Свидник":[
		"Зерно",
		],
	"Замосць": [
		"Зерно",
		],
	"Нароль": [
		"Зерно",
		],
	"Раковчик": [
		"Зерно",
		],
	"Пядичи": [
		"Зерно",
		],
	"Нырков": [
		"Зерно",
		],
	"Залещики": [
		"Зерно",
		],
	"Заставна": [
		"Зерно",
	],
	"Мигово": [
		"Зерно",
		],
	"Вижница": [
		"Зерно",
	],
	"Богородчаны": [
		"Зерно",
		],
	"Угринов": [
		"Зерно",
	],
	"Тлумач": [
		"Зерно",
		],
	"Отыния": [
		"Зерно",
	],
	"Заболотов": [
		"Зерно",
		],
	"Делятин": [
		"Зерно",
	],
	"Надворная": [
		"Зерно",
		],
	"Поляница": [
		"Зерно",
		],
	"Ворохта": [
		"Зерно",
	],
	"Рахов": [
		"Зерно",
		],
	"Жешув": [
		"Зерно",
	],
	"Кросно": [
		"Зерно",
		],
	"Яремче": [
		"Зерно",
		],
	"Червоноград": [
		"Зерно",
		],
	"Трускавец": [
		"Зерно",
		],

}
