extends Node


const graph: Dictionary = {
	
}


var provinces_of_countries: Dictionary = {
	"Хорезм":   
		["Лодзь", "Станислав", "Черновцы", "Галич", "Калуш", "Познань", "Ровно",],
	"Горния":  
		 ["Черновицы", "Тарнополь", "Кременец", "Броды"],
	"Баскония":
		 ["Рутивль", "Перемышль", "Батые"],
	"СЗ":      
		 ["Луцк"],
	"Кракожия": 
		["Коломна", "Витебск"],
	"Баскакская Торговая Компания":
		 ["Подолье", "Любич", "Теребовль", "Пинск", "Гродно"],
	"Баскакия":   
		["Вручий", "Тулов", "Желув", "Горловка", "Сумы", "Житомир", "Черкасс", "Покровск", "Изюм", "Макеевка"],
	"Поляния":   
		 ["Херсон", "Полтава"],
	"Амани":     
		 ["Симферополь", "Винница"],
	"Адамантия": 
		 ["Должанск", "Бердичев", "Константиновка", "Новомосковск",  "Коростень", "Измаил"],
	"Насардия":  
		 ["Донецк", "Ченстохова", "Катовице", "Николаев", "Берегово", "Буковина", "Пшемысль"],
	"Кавардация":
		 ["Дубно", "Хмельницкий", "Севастополь", "Закопане"],
	"Тернокат":  
		 ["Ужгород", "Каменец-Подольск",],
	"Иллирия":   
		 ["Львов", "Борка", "Звижень", "Гримайлов", "Ивано-Франковск", "Болехов"], #Западный Азис
	"Кривечия":
		["Волынский", "Ковель", "Щепеткова", "Проскуров", "Коломыя", "Стрый"],
	"Теверция":  
		 ["Белая Церковь", "Павлоград", "Мелитополь", "Лисичанск", "Пмлица"], #Третья Поляния
	"Зличания":  
		 ["Мукачево", "Нетешин", "Дрогобыч", "Старокостантинов", ],  #Вольная Поляния
}

	#"Черногорск",


const resourses: Dictionary = {
	"Изюм":     {"Железо": 2},
	"Покровск": {"Железо": 1,
				 "Уголь":  1},
	"Черкасс":  {"Уголь":  2},
	"Суммы":    {"Железо": 1,
				 "Зерно":  1},
	"Житомир":  {"Скот":   2},
	"Горловка": {"Скот":   1,
				"Зерно":   1},
	"Сумы":     {"Скот":   1,
				"Зерно":   1},
	"Желув":     {"Скот":   1,
				  "Зерно":   1},
	"Тулов":    {"Скот":   1,
				 "Зерно":   2},
	"Вручий":   {"Уголь":  1},
	"Желов":    {"Уголь":  1},
	"Макеевка": {"Скот":   2},
	
	"Любич":      {"Уголь":  1,
				   "Нефть":  1},
	"Подолье":    {"Уголь":  2,},
	"Теребовль":  {"Нефть":  1},
	"Пинск":      {"Скот":   2},
	"Гродно":     {"Зерно":  2,
				   "Скот":   1},
	
	"Коломна": {"Нефть":  1,
				"Хлопок": 1},
	"Витебск": {"Хлопок": 2,
				"Скот":   2,
				"Табак":  1,
				"Лекарственные_растения": 1},
	
	"Броды":     {"Уголь":  1,
				  "Железо": 1},
	"Кременец":  {"Скот":   2,
				  "Табак":  1,
				  "Хлопок": 2},
	"Тарнополь": {"Уголь":  2},
	"Черновицы": {"Лекарственные_растения": 1,
				  "Скот":   1,
				  "Зерно":  1},
	
	"Лодзь":     {"Уголь":  1,
				  "Железо": 1,
				  "Нефть":  1},
	"Станислав": {"Хлопок": 1,
				  "Скот":   1,
				  "Зерно":  1,
				  "Табак":  1,},
	"Галич":     {"Хлопок": 2,
				  "Табак":  1},
	"Черновцы":  {"Уголь":  1,
				  "Железо": 1,},
	"Калуш":     {"Нефть":  1},
	"Познань":   {"Лекарственные_растения": 2,
				  "Хлопок": 1},
	"Ровно":     {"Резина": 1},
	
	"Луцк": {"Уголь":  1,
			 "Железо": 1,
			 "Зерно":  1,
			 "Скот":   1,
			 "Хлопок": 1},
	
	"Рутивль":   {"Нефть":  1},
	"Перемышль": {"Уголь":  1,
				  "Железо": 1,
				  "Табак":  1},
	"Батые":     {"Хлопок": 1,
				  "Скот":   1,
				  "Зерно":  1,
				  "Табак":  1},
	
	"Коломыя":   {"Нефть":  2},
	"Стрый":     {"Хлопок": 1,
				  "Скот":   1,},
	"Ковель":    {"Резина": 2},
	"Щепеткова": {"Резина": 1,
				  "Хлопок": 1,},
	"Волынский": {"Резина": 1,
				  "Табак":  1},
	"Проскуров": {"Резина": 1,
				  "Лекарственные_растения": 1},
	
	"Львов":   {"Резина": 1,
				"Табак":  1,
				"Хлопок": 1,
				"Зерно":  1},
	"Болехов": {"Резина": 1,
				"Скот":   1,
				"Хлопок": 1,
				"Зерно":  1},
	"Борка":   {"Резина": 1,
				"Табак":  1,
				"Хлопок": 1,
				"Зерно":  1},
	"Звижень": {"Резина": 1,
				"Табак":  1,
				"Хлопок": 1,
				"Зерно":  1},
	"Гримайлов": {"Зерно": 1,
				  "Скот":  1},
	
	"Ивано-Франковск": {"Зерно": 1,
						"Скот":  1},
	"Хмельницкий": {"Зерно": 1,
					"Скот":  1,
					"Хлопок": 1},
	"Дубно":       {"Железо": 2,
					"Уголь":  1},
	
	"Ужгород":     {"Железо": 1,
					"Уголь":  1,
					"Скот":   1,
					"Зерно":  1},
	"Каменец-Подольск": {"Железо": 1,
						 "Уголь":  1,
						 "Скот":   1,
						 "Зерно":  1},
	
	"Нетешин":  {"Скот":   1,
				 "Зерно":  1,
				 "Уголь":  2,},
	"Дрогобыч":  {"Зерно": 1,
				  "Скот":  1,
				  "Хлопок": 1},
	"Старокостантинов": {"Зерно": 1,
						 "Скот":  1,
						 "Хлопок": 1},
	"Мукачево": {"Железо": 1,
				 "Уголь":  2,},
	
	"Лисичанск":  {"Железо": 1,
				   "Уголь":  2,},
	"Павлоград":  {"Железо": 1,
				   "Уголь":  2,},
	"Мелитополь": {"Зерно": 1,
				   "Скот":  1,
				   "Хлопок": 1},
	"Пмлица":     {"Хлопок": 1,
				   "Лекарственные_растения": 1,
				   "Табак": 1},
	"Белая Церковь": {"Хлопок": 1,
					  "Лекарственные_растения": 1,
					  "Табак": 1},
	
	"Севастополь": {"Резина": 1,
					"Хлопок": 1,
					"Табак":  1},
	"Закопане":    {"Резина": 1,
					"Хлопок": 1,
					"Табак":  1},
	
	"Буковина":   {"Хлопок": 1,
				   "Лекарственные_растения": 1,
				   "Табак": 1},
	"Берегово":   {"Зерно": 2,
				   "Скот":  2,},
	"Ченстохова": {"Железо": 2,
				   "Уголь":  1,},
	"Пшемысль":   {"Зерно": 2,
				   "Скот":  2,},
	"Донецк":     {"Железо": 2,
				   "Уголь":  1,
				   "Зерно":  1,
				   "Скот":   1,},
	"Катовице":   {"Железо": 1,
				   "Уголь":  2,},
	"Николаев":   {"Зерно": 2,
				   "Скот":  2,},
	
	"Винница":     {"Железо": 2,
					"Уголь":  2,},
	"Симферополь": {"Железо": 1,
					"Уголь":  1,
					"Зерно":  1,
					"Скот":   1,},
	
	"Херсон":      {"Железо": 2,
					"Уголь":  1,
					"Зерно":  1,
					"Скот":   1,},
	"Полтава":     {"Железо": 2,
					"Уголь":  1,
					"Зерно":  1,
					"Скот":   1,},
	
	"Должанск":       {"Железо": 1,
					   "Уголь":  2,},
	"Бердичев":       {"Железо": 2,
					   "Уголь":  1,},
	"Новомосковск":   {"Железо": 2,
					   "Уголь":  1,},
	"Коростень":      {"Железо": 1,
					   "Уголь":  2,
					   "Зерно":  1,
					   "Хлопок": 1},
	"Измаил":         {"Зерно":  2,
					   "Скот":   2},
	"Константиновка": {"Железо": 2,
					   "Уголь":  1,},
	#"": {},
	
	
}


const factories_on_start: Dictionary = {
	"Лодзь": ["Сталь"],
}
