extends Node


var provinces_of_countries: Dictionary = {
	"Хорезм":   
		["Лодзь", "Станислав", "Черновцы", "Галич", "Калуш", "Познань", "Ровно", "Богородчаны", "Днестр", "Тлумач", "Белжеца", "Митава"],
	"Горния":  
		 ["Тарнополь", "Кременец", "Броды", "Люблин", "Красник"],
	"Баскония":
		 ["Рутивль", "Перемышль", "Батые", "Пядичи", "Рутивль", "Заболотов", "Брзежаны",],
	"СЗ":      
		 ["Луцк"],
	"Кракожия": 
		["Витебск", "Надворная", "Дукшты"],
	"Баскакская Торговая Компания":
		 ["Подолье", "Любич", "Теребовль", "Пинск", "Гродно"],
	"Баскакия":   
		["Вручий", "Тулов", "Желув", "Горловка", "Сумы", "Житомир", "Черкасс", "Покровск", "Изюм", "Макеевка"],
	"Поляния":   
		 ["Херсон", "Полтава"],
	"Амани":     
		 ["Симферополь", "Винница"],
	"Адамантия": 
		 ["Должанск", "Бердичев", "Константиновка", "Новомосковск",  "Коростень", "Измаил", "Горлица", "Яремче", "Тамань"],
	"Насардия":  
		 ["Донецк", "Ченстохова", "Катовице", "Николаев", "Берегово", "Буковина", "Пшемысль", "Николаев", "Стецки"],
	"Кавардация":
		 ["Хмельницкий", "Севастополь", "Закопане", "Ивано-Франковск", "Зборов", "Каменец-Подольск",],
	"Тернокат":  
		 ["Ужгород", "Дубно", "Белецкое", "Иршики"],
	"Иллирия":   
		 ["Львов", "Борка", "Звижень", "Гримайлов", "Болехов"], #Западный Азис
	"Кривечия":
		["Волынский", "Ковель", "Щепеткова", "Проскуров", "Коломыя", "Стрый"],
	"Теверция":  
		 ["Белая Церковь", "Павлоград", "Мелитополь", "Лисичанск", "Пмлица", "Грубешов", "Вилькомир"], #Третья Поляния
	"Зличания":  
		 ["Мукачево", "Нетешин", "Дрогобыч", "Старокостантинов",],  #Вольная Поляния
	"Суеция":
		["Клайпеда", "Каунас", "Алитус", "Паневежис"],
	"Роксолания":
		["Пярну", "Тарту", "Пярну", "Раквере", "Вильянди", "Силламяэ", "Курессааре", "Хаапсалу"],
}
