extends Node


const graph: Dictionary = {
	"Черновцы": ["Лодзь", "Станислав", "Галич", "Калуш"],
}


var provinces_of_countries: Dictionary = {
	"Хорезм":   
		["Лодзь", "Станислав", "Черновцы", "Галич", "Калуш", "Познань", "Ровно",],
	"Горния":  
		 ["Черновицы", "Тарнополь", "Кременец", "Броды"],
	"Баскония":
		 ["Рутивль", "Перемышль", "Батые"],
	"СЗ":      
		 ["Луцк"],
	"Кракожия": 
		["Коломна", "Витебск"],
	"Баскакская Торговая Компания":
		 ["Подолье", "Любич", "Теребовль", "Пинск", "Гродно"],
	"Баскакия":   
		["Вручий", "Тулов", "Желув", "Горловка", "Сумы", "Житомир", "Черкасс", "Покровск", "Изюм", "Макеевка"],
	"Поляния":   
		 ["Херсон", "Полтава"],
	"Амани":     
		 ["Симферополь", "Винница"],
	"Адамантия": 
		 ["Должанск", "Бердичев", "Константиновка", "Новомосковск",  "Коростень", "Измаил", "Горлица"],
	"Насардия":  
		 ["Донецк", "Ченстохова", "Катовице", "Николаев", "Берегово", "Буковина", "Пшемысль"],
	"Кавардация":
		 ["Дубно", "Хмельницкий", "Севастополь", "Закопане", "Ивано-Франковск"],
	"Тернокат":  
		 ["Ужгород", "Каменец-Подольск",],
	"Иллирия":   
		 ["Львов", "Борка", "Звижень", "Гримайлов", "Болехов"], #Западный Азис
	"Кривечия":
		["Волынский", "Ковель", "Щепеткова", "Проскуров", "Коломыя", "Стрый"],
	"Теверция":  
		 ["Белая Церковь", "Павлоград", "Мелитополь", "Лисичанск", "Пмлица"], #Третья Поляния
	"Зличания":  
		 ["Мукачево", "Нетешин", "Дрогобыч", "Старокостантинов",],  #Вольная Поляния
}

	#"Черногорск",


const resourses_of_provinces: Dictionary = {
	"Изюм": ["Железо", "Сталь",],
	
	"Покровск": ["Железо", "Уголь", "Сталь",],
	
	"Черкасс": [
		"Уголь",
		"Сталь", 
		"Стекло",
		],
	
	"Житомир": [
		"Скот",
		"Древесина",
		"Пиломатериалы",
		"Мебель"
		],
	
	"Горловка": [
		"Скот",
		"Зерно",
		"Древесина",
		"Пиломатериалы",
		"Мебель",
		
		],
	
	"Сумы": [
		"Древесина",
		"Скот",
		"Зерно",
		"Спиртное",
		],
	
	"Желув": [
		"Древесина",
		"Скот",
		"Зерно",
		"Спиртное",
		
		],
	
	"Тулов": [
		"Скот",
		"Зерно",
		"Древесина",
		"Пиломатериалы",
		"Мебель",
		"-Хлеб"
		],
	
	"Вручий": [
		"Уголь",
		"Стекло",
		"+Ворохта",
		],

	"Желов": [
		"Уголь",
		"Древесина",
		"Пиломатериалы",
		"Мебель"
		],
	
	"Макеевка": [
		"Скот",
		"Древесина",
		"Пиломатериалы",
		"Мебель"
		],
	
	"Любич": [
		"Уголь",
		 "Нефть",
		 "Топливо",
		"+Поляница",
		],

	"Подолье": [
		"Уголь",
		"Стекло",
		],
	
	"Теребовль": [
		"Нефть",
		],
	
	"Пинск": [
		"Скот",
		"Древесина",
		],
	
	"Гродно": [
		"Зерно",
		"Скот",
		"Древесина",
		"+Заставна",
		],
	
	"Коломна": [
		"Нефть",
		"Хлопок",
		"Древесина",
		"Топливо",
		"Пиломатериалы",
		"Ткань",
		"+Надворная",
		],
	
	"Витебск": [
		"Хлопок",
		"Скот",
		"Табак",
		"Лекарственные_растения",
		"Лекарства",
		"Ткань",
		"+Делятин",
		],
	
	"Броды": [
		"Уголь",
		"Железо",
		"Сталь",
		"+Нырков",
		"+Залещики",
		"+Мигово",
		],
	
	"Кременец": [
		"Скот",
		"Табак",
		"Хлопок",
		"Ткань",
		"Одежда",
		"+Гуменне",
		"+Снина",
		"+Раковчик",
		],
	
	"Тарнополь": [
		"Уголь",
		"Стекло"
		],
	
	"Черновицы": [
		"Лекарственные_растения",
		 "Скот",
		 "Зерно",
		"Лекарства",
		"+Замосць",
		"+Свидник",
		],
	
	"Лодзь": [
		"Уголь",
		"Железо",
		"Нефть",
		"Топливо",
		"+Вижница",
		],
	
	"Станислав": [
		"Хлопок",
		"Скот",
		"Зерно",
		"Табак",
		"Ткань",
		"Одежда",
		
		"+Нароль",
		],
	
	"Галич": [
		"Хлопок",
		"Табак",
		"Ткань",
		"Одежда",
		],

	"Черновцы": [
		"Уголь",
		"Железо",
		"Сталь",
		"Автозапчасти",
		"+Богородчаны",
		],
	
	"Калуш": [
		"Нефть",
		"Топливо",
		"+Угринов",
		"+Тлумач",
		],
	
	"Познань": [
		"Лекарственные_растения",
		"Хлопок",
		"Лекарства",
		],
	"Ровно": [
		"Резина",
		"Сталь",
		"Автомобили",
		"+Берегели",
		],
	
	"Луцк": [
		"Уголь",
		"Железо",
		"Зерно",
		"Скот",
		"Хлопок",
		"Сталь",
		"Автозапчасти",
		"Ткань",
		"Одежда",
		
		
		],
	
	"Рутивль": [
		"Нефть",
		"Топливо",
		"+Отыния",
		"+Заболотов",
		],
	
	"Перемышль": [
		"Уголь",
		"Железо",
		"Табак",
		"Сталь",
		"+Пядичи",
		"+Самчинцы",
		],
	
	"Батые": [
		"Хлопок",
		"Скот",
		"Зерно",
		"Табак",
		"Консервы",
		"+Деркачи",
		],
	
	"Коломыя": [
		"Нефть",
		"Зерно",
		"Топливо",
		
		],
	
	"Стрый": [
		"Хлопок",
		"Скот",
		"Зерно",
		
		],
	
	"Ковель": [
		"Резина",
		"Зерно",
		"Древесина",
		
		],

	"Щепеткова": [
		"Резина",
		"Хлопок",
		"Зерно",
		"Древесина",
		
		"Ткань",
		"Одежда",
		],
	
	"Волынский": [
		"Резина",
		"Табак",
		"Зерно",
		"Древесина",
		
		],
	
	"Проскуров": [
		"Резина",
		"Лекарственные_растения",
		"Зерно",
		"Древесина",
		
		],
	
	"Львов": [
		"Резина",
		"Табак",
		"Хлопок",
		"Зерно",
		"Древесина",
		
		],
	
	"Болехов": [
		"Резина",
		"Скот",
		"Хлопок",
		"Зерно",
		"Древесина",
		"+Верхняки"
		],
	
	"Борка": [
		"Резина",
		"Табак",
		"Хлопок",
		"Зерно",
		"Древесина",
		
		],
	
	"Звижень": [
		"Резина",
		"Табак",
		"Хлопок",
		"Зерно",
		"Древесина",
		
		],
	"Гримайлов": [
		"Зерно",
		"Скот",
		
		],
	
	"Ивано-Франковск": [
		"Зерно",
		"Скот",
		
		],
	
	"Хмельницкий": ["Резина", "Зерно", "Скот", "Хлопок", "Ткань", "-Хлеб"],
	
	"Дубно": ["Резина", "Железо", "Уголь", "Селитра", "Зерно", "+Иршики"],
	
	"Ужгород": [
		"Железо",
		"Уголь",
		"Скот",
		"Зерно",
		
		],
	
	"Каменец-Подольск": ["Железо", "Уголь", "Скот", "Зерно",  "Сталь", "Автозапчасти", "+Белецкое"],
	
	"Нетешин": [
		"Скот",
		"Зерно",
		"Уголь",
		"Резина",
		"Стекло",
		"Электрозапчасти",
		],
	
	"Дрогобыч": [
		"Зерно",
		"Скот",
		"Хлопок"],
	
	"Старокостантинов": [
		"Резина",
		"Зерно",
		"Скот",
		"Хлопок",
		],
	
	"Мукачево": ["Железо", "Уголь", "Селитра", "Зерно", "3Сталь", "Автозапчасти", "Автомобили", "+Круча"],
	
	"Лисичанск": [
		"Железо",
		"Уголь",
		"+Жабче",
		],
	
	"Павлоград": [
		"Железо",
		"Уголь",
		],
	
	"Мелитополь": [
		"Зерно",
		"Скот",
		"Хлопок",
		"+Радковцы",
		],

	"Пмлица": [
		"Хлопок",
		"Лекарственные_растения",
		"Табак",
		"+Хуторы",
		],
	
	"Белая Церковь": [
		"Хлопок",
		"Лекарственные_растения",
		"Табак",
		"Лекарства",
		],
	
	"Севастополь": [
		"Резина",
		"Хлопок",
		"Табак",
		"Ткань",
		],
	
	"Закопане": [
		"Резина",
		"Хлопок",
		"Табак",
		"Ткань",
		"Древесина",
		"Одежда",
		],
	
	"Буковина": [
		"Хлопок",
		"Лекарственные_растения",
		"Табак",
		"Древесина",
		"Лекарства",
		],
	
	"Берегово": [
		"Зерно",
		"Скот",
		"Древесина"
		],
	
	"Ченстохова": [
		"Железо",
		"Уголь",
		"Древесина",
		"Сталь"
		],
	
	"Пшемысль": [
		"Зерно",
		"Скот",
		"Древесина",
		"Спиртное",
		],
	
	"Донецк": [
		"Железо",
		"Уголь",
		"Зерно",
		"Скот",
		"Древесина",
		"Спиртное",
		],

	"Катовице": [
		"Железо",
		"Уголь",
		"Древесина",
		"Зерно",
		"+Стецки",
		],
	
	"Николаев": [
		"Зерно",
		"Скот",
		"Древесина",
		
		],
	
	"Винница": [
		"Железо",
		"Уголь",
		"Древесина",
		"Зерно",
		"+Огиевцы",
		
		],
	
	"Симферополь": [
		"Железо",
		"Уголь",
		"Зерно",
		"Скот",
		
		],
	
	"Херсон": [
		"Железо",
		"Уголь",
		"Древесина",
		"Скот",
		"Пиломатериалы",
		],
	
	"Полтава": [
		"Железо",
		"Уголь",
		"Зерно",
		"Скот",
		"Спиртное",
		"-Хлеб",
		"+Громовка",
		],
	
	"Должанск": [
		"Железо",
		"Уголь",
		"Древесина",
		"Сталь",
		"+Рахов",
		"+Жешув",
		],
	
	"Бердичев": [
		"Железо",
		 "Уголь",
		"Древесина",
		"Зерно",
		
		"+Трускавец",
		"+Кросно",
		
		],
	
	"Горлица": [
		 "Уголь",
		"Древесина",
		"Зерно",
	],
	
	"Новомосковск": [
		"Железо",
		"Уголь",
		"Древесина",
		"+Яремче"
		],
	
	"Коростень": [
		"Железо",
		"Уголь",
		"Зерно",
		"Хлопок",
		
		],
	
	"Измаил": [
		"Зерно",
		"Скот",
		"Древесина",
		"Спиртное",
		"+Червоноград",
		],
	
	"Константиновка": [
		"Железо",
		"Уголь",
		"Древесина",
		"Зерно",
		
		],
}


var resourses_of_villages: Dictionary = {
	
	"Снина":[],
	
	"Гуменне":[],
	
	"Свидник":[],
	
	"Замосць": [],

	"Нароль":[],
	
	"Раковчик":[],
	
	"Пядичи": [],
	
	"Нырков": [],
	
	"Залещики":[],
	
	"Заставна": [],

	"Мигово": [],

	"Вижница":[],

	"Богородчаны": [],

	"Угринов": [],
	
	"Тлумач": [],

	"Отыния": [],

	"Заболотов": [],

	"Делятин": [],

	"Надворная": [],

	"Поляница": [],

	"Ворохта": [],

	"Рахов": [],

	"Жешув": [],

	"Кросно": [],

	"Яремче": [],

	"Червоноград": [],
	
	"Трускавец": [],
	
	"Огиевцы": [],
	"Половинники": [],
	"Громовка": [],
	"Хуторы": [],
	"Радковцы": [],
	"Жабче": [],
	"Стецки": [],
	"Круча": [],
	"Иршики": [],
	"Белецкое" : [],
	
	"Верхняки" : [],
	"Берегели" : [],
	"Деркачи" : [],
	"Самчинцы" : [],
	


}
