extends Node

var relations_of_ideologies_friendship: Dictionary = {
'Милитаристы': ["Монархисты"],
"Коммунисты": ["Социалисты"],
"Либералы": ["Монархисты", "Социалисты"],
"Социалисты": ["Социалисты"],
"Монархисты": ['Милитаристы', "Либералы", "Социалисты"],}

var relations_of_ideologies_Enmity: Dictionary = {
'Милитаристы': ["Коммунисты", "Либералы", "Социалисты"],
"Коммунисты": ['Милитаристы', "Либералы", "Монархисты"],
"Либералы": ["Коммунисты", 'Милитаристы'],
"Социалисты": ['Милитаристы'],
"Центризм": [ "Монархисты"],
"Монархизм": ["Коммунисты"],}
