extends Node

var max_levels: Dictionary = {
	"Фабричное производство":  6,
	"Фермерское производство": 5,
	"Добыча":                  5,
	"Инфраструктура":          5,
	
	"Управление армией":       5,
	"Техника":                 6,
	"Тяжелое вооружение":      6,
	"Легкое вооружение":       5,
}


var research: Dictionary = {
	"Фабричное производство":  "factory_production",
	"Фермерское производство": "farm_production",
	"Добыча":                  "resourses_production",
	"Инфраструктура":          "railways",
	
	"Управление армией":       "factory_production",
	"Техника":                 "factory_production",
	"Тяжелое вооружение":      "factory_production",
	"Легкое вооружение":       "factory_production",
}


const factory_production: Dictionary = {
	"Плавильные печи":       {},
	"Поточное производство": {},
	"Искусственная резина":  {},
	"Сборочные конвейеры":   {},
	"Военная экономика":     {}, #Сжижение угля
	"Полимеры":              {},
}


const farm_production: Dictionary = {
	"Гос. субсидии":         {},
	"Гусеничные машины":     {},
	"Фермерские тракторы":   {},
	"Введение тракторов":    {},
	"Частичная механизация": {},
}


const resourses_production: Dictionary = {
	"Электропечи":           {"Железо":    15,
								"Уголь":   10,},
	
	"Частичная механизация": {"Железо":    10,
								"Уголь":   10,
								"Сталь":   5,
								"Селитра": 5,},
								
	"Нержавеющая сталь":     {"Железо":    10,
								"Уголь":   10,
								"Сталь":   20},
								
	"Переработка нефти":     {"Железо":    5,
								"Уголь":   5,
								"Селитра": 5,
								"Резина":  5,
								"Нефть":   10,
								"Топливо": 10},
								
	"Механизация шахт":      {"Железо":    15,
								"Уголь":   15,
								"Селитра": 5,
								"Резина":  5,},
}


const railways: Dictionary = {
	"Электростанции":          {},
	"Рельсы узкой колеи":      {},
	"Рельсы для фабрик":       {},
	"Автобаны":                {},
	"Система автобанов":       {},
}


func research_completed():
	pass
	

func production_research_completed():
	pass
	
