extends Node


const chars_of_units: Dictionary = {
	"Аэроплан-разведчик":   {
		"Оборона":  2,
		"Разведка": 2,
		"Скорость": 4,
	},
	"Боевой аэроплан":      {
		"Оборона":  4,
		"ПВО":      2,
		"Атака":    1,
		"Разведка": 1,
		"Скорость": 5,
	},
	"Аэроплан-истребитель": {
		"Оборона":  6,
		"ПВО":      5,
		"Разведка": 1,
		"Скорость": 6,
	},
	"Бомбардировщик":       {
		"Оборона":  4,
		"ПВО":      2,
		"Атака":    4,
		"Разведка": 1,
		"Скорость": 4,
	},
	
	"Фронтовики":           {
		"Оборона":  2,
		"Атака":    2,
		"Скорость": 3,
	}, 
	"Гренадеры":        {
		"Оборона":  2,
		"Атака":    6,
		"Скорость": 3,
	}, 
	"Артиллерия":       {
		"Оборона":  3,
		"ПВО":      0,
		"Атака":    4,
		"Скорость": 2,
	},
	
	"Кавалерия":        {
		"Оборона":  2,
		"Атака":    3,
		"Скорость": 5,
	},
	"Бронемашины":      {
		"Оборона":  10,
		"ПВО":      0,
		"Атака":    4,
		"Скорость": 6,
	},
	"Танки":            {
		"Оборона":  16,
		"Атака":    6,
		"Скорость": 5,
	},
	
	"Подводная лодка":     {},
	"Рейдер":              {},
	
	"Дредноут":            {},
	"Броненосец":          {},
	"Крейсер смерти":      {},
	"Броненосец смерти":   {},
}


const cost_of_units: Dictionary = {
"Аэроплан-разведчик":   {
		"Аэроплан":  2,
		"Пулеметы":  1,
		"Боеприпасы":1,
	},
	"Боевой аэроплан":      {
		"Аэроплан":  2,
		"Пулеметы":  2,
		"Боеприпасы":2,
	},
	"Аэроплан-истребитель": {
		"Аэроплан":  4,
		"Пулеметы":  4,
		"Сталь":     1,
		"Радио":     1,
		"Боеприпасы":4,
	},
	"Бомбардировщик":       {
		"Аэроплан":  4,
		"Пулеметы":  4,
		"Сталь":     1,
		"Радио":     1,
		"Боеприпасы":4,
		"Снаряды":   4,
	},
	
	"Фронтовики":           {
		"Магазинные_винтовки": 2,
		"Пулеметы":            1,
		"Боеприпасы":          2,
	}, 
	"Гренадеры":        {
		"Магазинные_винтовки": 3,
		"Боеприпасы":          6,
		"Пулеметы":            2,
	}, 
	"Артиллерия":       {
		"Артиллерия":          2,
		"Пулеметы":            1,
		"Магазинные_винтовки": 1,
		"Боеприпасы":          1,
		"Снаряды":             2,
	},
	
	"Кавалерия":        {
		"Магазинные_винтовки": 1,
	},
	"Бронемашины":      {
		"Бронемашины":         1,
		"Магазинные_винтовки": 1,
		"Боеприпасы":          1,
		"Снаряды":             1,
	},
	"Танки":            {
		"Танки":               1,
		"Магазинные_винтовки": 1,
		"Боеприпасы":          2,
		"Снаряды":             2,
	},
	
	"Подводная лодка":     {},
	"Рейдер":              {},
	
	"Дредноут":            {},
	"Броненосец":          {},
	"Крейсер смерти":      {},
	"Броненосец смерти":   {},
}


const food_for_training: Dictionary = {
	"Зерно":               2,
	"Хлеб":                2,
	"Консервы":            1,
	"Табак":               1,
	#"Лекарства":           1,
	"Чай":                 1,
	"Спиртное":            2,
	"Одежда":              2,
}


func create_division(province, list_of_battalions, player):
	var division = load("res://Objects/Division/Division.gd").new()
	var list_of_battalions_object = []
	
	for i in list_of_battalions:
		var battalion = load("res://Objects/Division/Battalion.gd").new()
		battalion.tipe_of_battalion = i
		battalion.set_chars()
		list_of_battalions_object.append(battalion)
	
	division.list_of_battalions.append_array(list_of_battalions_object)
	division.player =   player
	division.province = province
	division.game =     player.game
	
	division.set_chars()
	division.start_training()
